/* 
Задача 1. Напишете програма, която сумира всички елементи на масив
намиращи се на четна позиция:
int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
Декларирайте пойнтер към първата нечетна позиция, инкрементирайте
пойнтера по подходящ начин, за да извършите сумирането.
*/
#include <stdio.h>

int sumOdd(int arr[], int N);

int main(){
    int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};   
    printf("%d", sumEven(arr,10));
    return 0;
}
int sumOdd(int a[], int N){
    int *p = a+1; 
    int sum = 0;
    while(p<a+N){
        sum += *p; 
        p+=2;
    }
    return sum;
}