/*
Задача 10.
Напишете функциите като макроси:
1. функция AVG(x, y), която смята средното аритметично на две подадени
като параметър числа.
*/
#include <stdio.h>
#define AGV(x,y) ((x+y)/2.0)

int main() {
    printf("result of AGV is: %.2f", AGV(10,20));
    return 0;
}