/*
Задача 5.
Дефинирайте и инициализирайте int променлива = 34 и
пойнтер към нея.
Опитайте да ги разместите, като поредност (първо да е
пойнтерът, после променливата).
*/

#include <stdio.h>
int main(){
   /* int *p = &a; 'a' undeclared */
    int a = 34;
    int *p;
    p = &a;
    int *q = &a;
    printf("%d\n", *q*(*p));
    /* printf("%g\n", q*p); invalid operands to binary */
    printf("%d\n", a);
    printf("%d\n", *p);
    return 0;
}
/*Можете ли да умножите пойнтер по пойнтер? - отговор: Само стойностите им може да умножим.
При тази декларация колко пойнтера имаме:
int *p, k; Отг: 1 поинтер p и една променлива k от тип int.
*/
