/*
Задача 10.
Как работи? Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d.
*/

#include <stdio.h>
int main(){
    int a = 10;
    int *p = NULL;
    printf("%p\n", &a); /*addres of a: 000000000061FE1C */
    p = &a;
    printf("%p\n", *p); /*hexidesimal value of a: 000000000000000A */
    printf("%d\n", a); /* 10 */
    printf("%d\n", *p); /*  *p = *(&a) = a = 10 */
    printf("%p\n", p); /* address saved in the pointer: 000000000061FE1C */
    printf("%p\n", &p); /* address of the pointer: 000000000061FE10 */
    return 0;
}

