/*
Задача 4.
Дефинирайте пойнтер и опитайте да отпечатате стойността
му на конзолата (%р) с printf.
Какво се визуализира?
*/

#include <stdio.h>
int main(){
    int *p;
    printf("%p\n", &p); /* 000000000061FE18 */
    printf("%p", p); /* 0000000000000010 */
    return 0;
}

