/*
Задача 8.
Дефинирайте и инициализирайте променлива и пойнтер
към нея. Отпечатайте адреса на пойнтера с %p с printf
*/

#include <stdio.h>
int main(){
    int a = 10;
    int *p = &a;
    printf("%p\n", &a); /* 000000000061FE1C */
    printf("%p\n", p);  /* 000000000061FE1C печата адреса, който се съдържа в поинтера*/
    printf("%p", &p);   /* 000000000061FE10 печата адреса на променливата p, която е от тип поинтер*/
    return 0;
}

