/*
Задача 6.
Дефинирайте променлива „а“, дeфинирайте пойнтер към
нея, присвоете му адреса на променливата. През пойнтера
задайте нова стойност = 5 на променливата „а“. Каква е
стойността на “а”?
*/

#include <stdio.h>
int main(){
    int a = 34;
    int *p;
    p = &a;
    *p = 5; /* this is the new value og a */
    printf("%d", a); /* 5 */
    return 0;
}

