/*
Задача 7.
Направете програма, в която инициализирате пойнтер към
променлива и след това изчислявате сбор на променливата
(използвайки пойнтера) + 5. Отпечатайте на екрана.
*/

#include <stdio.h>
int main(){
    int a = 10;
    int *p = &a;
    a = *p+5; /* a = 10 + 5 */
    printf("%d", a); /* 15 */
    return 0;
}

