/*
Задача 11.
Напишете програма, която умножава 2 числа, като
използва пойнтер-и.
Пойнтер-ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери.
*/

#include <stdio.h>
int main(){
    int a = 10;
    int b = 20;
    int *p = &a;
    int *q = &b;
    float c = 3.3;
    float *k = &c;
    printf("%d\n", *p*(*q)); /* 10*20 = 200 */
    printf("%f", *p*(*k)); /* 10*3.3 = 33.000000 */

    return 0;
}

