/*
Задача 20.Движението по дълга улица на “Експрес Такси” е организирано, така че 
има спирка на всеки километър. “Експрес Такси” се движи по улицата от всяка спирка 
1,2,3... или 10 километра без спиране. За всеки от десетте разстояния цените са 
дадени в таблица, например:
1 12
2 21
3 31
4 40
5 49
6 58
7 69
8 79
9 90
10 101
Пътник иска да пътува n (1<=n<=100) километра. Какви разстояния на пътуване трябва 
да избере, така че пътуването да му излезе най-евтино, и каква е цената на цялото 
пътуване? Напишете програма, която да реши проблема.
Входни данни: В първия ред от входния файл INPUT3.TXT са записани 10 цели числа, 
които са цените за пътуване, съответно на 1,2,3... ,10 километра, а във втория ред е 
записано само числото n. 
Изходни данни: Всеки ред без последния от изходния файл OUTPUT3.TXT трябва да 
съдържа две числа - дължината на маршрута и цената на билета. Цената на цялото 
пътуване трябва да се запише на последния ред от изходния файл.
Примерен вход
INPUT3.TXT
12 21 31 40 49 58 69 79 90 101
15
Примерен изход
OUTPUT3.TXT
3 31
6 58
6 58
147 
*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

static const char *FORMAT_IN = "(%d, %d, %d, %d, %d, %d, %d, %d, %d, %d\n%d)\n";
static const char *FORMAT_OUT = "(%d %d\n%d %d\n%d)\n";

int price[10] = {12, 21, 31, 40, 49, 58, 69, 79, 90, 101};
int main(void)
{
  int n;
  printf("How many kilometers do you want to travel between 1 and 100: ");
  scanf("%d", &n);
  char c;
  FILE *from, *to;

  from = fopen("task20.txt", "r");
  if (from == NULL)
  {
    perror("task20.txt doesn't exist.");
    exit(1);
  }

  to = fopen("task20IN.txt", "w");
  if (to == NULL)
  {
    perror("task20IN.txt doesn't exist.");
    exit(1);
  }
  while ((c = getc(from)) != EOF)
  {
    putc(c, to);
  }
  fclose(to);
  fclose(from);

  to = fopen("task20IN.txt", "a");
  fprintf(to, "\n%d", n);

  return 0;
}