/*
Задача за управление на проекти:
Напишете програма за управление на проекти. 
Въвеждат се проекти, като за всеки има следните атрибути:
име, описание, продължителност ( в човекодни ), списък от проекти от които зависи.
Направете методи за въвеждане и изтриване на проекти, както и методи за промяна на атрибутите на проект.
Описанието на всички проекти и техните връзки трябва да може да се записва и чете от /xml/ файл. 
Необходимо е да се направи процедура при дадена дата на начало на проектите и име на проект, 
да се изведат всички проекти които трябва да бъдат направени преди даден проект и дата на начало на проекта.
*/

#include "project.h"

int numberOfProjects = 2; // from function readFile is updated
project_t allProjects[50];

int main()
{   
    
    readFile();
    menu();
   
    return 0;
}

