/* Задача 4:
В какъв ред ще се изпълнят операциите?
true = x&&y&x<<1;
Какво ще се принтира на екрана?
В какъв ред ще се изпълнят операциите?
true = x&&y^x<<1;
Какво ще се принтира на екрана? */
#include <stdio.h>
int main()
{
    int x = 10;
    int y = 10;
    int true;

    true = x&&y&x<<1; // x<<1 -->20, y&20 --> 0 , x&&0 -->0, true = 0
    printf("true = %d\n", true);

    true = x&&y^x<<1; // x<<1 --> 20, y^20 -->30, x&&30 -->1, true = 1
    printf("true = %d", true);


}