/* Задача 3: имаме две променливи int x = 10; и int y = 10;
създайте две променливи int true, false; На true присвоете
резултата от инкрементирането на ++х плюс оператор логическо
ИЛИ поставен между х и у . Принтирайте резултата */

#include <stdio.h>
int main()
{
    int x = 10;
    int y = 10;

    int true;

    true = ++x + x || y; // условието може да бъде разбрано и така true = ++x||y;

    printf("true = %d", true);
}/* аз го разбирам така:
1: ++x, 11
2: 11 + x = 11+ 11 = 22
3: 22 || y връща 1
4: true = 1 */ 