
#include <stdio.h>
int main()
{
    int A = 0;
    int B = 0;

    if((! ( A && B ) == (! A || ! B)) && (! ( A || B ) == (! A && ! B))){
        printf("1. and 2.the same\n");
    }
    
    A = 1;
    B = 0;
    
    if((! ( A && B ) == (! A || ! B)) && (! ( A || B ) == (! A && ! B))){
        printf("3. and 4.the same\n");
    
    }
    A = 0;
    B = 1;
    
    if((! ( A && B ) == (! A || ! B)) && (! ( A || B ) == (! A && ! B))){
        printf("5. and 6.the same\n");
    }
    
    A = 1;
    B = 1;

    if((! ( A && B ) == (! A || ! B)) && (! ( A || B ) == (! A && ! B))){
        printf("7. and 8.the same");
    }
    
    
}/*Упражнение is 19*. Докажете опитно теоремите на Де Морган:
! ( А && B ) = ! A || ! B
! ( A || B ) = ! A && ! B
Под опитно доказване се разбира да се направят всичките четири
комбинации на A и B и за тях да се провери горното*/