/*
Задача 16.
Имаме 2 сортирани масиви А и В с по 88 елемента.
Образувайте масив С с 2х88 елемента образуван от смесването на А и В,
така че С да съдържа елементите на А и В, но да е подреден и да не се
налага да го сортираме отново.
Насоки: Проверяваме от кой масив да вземем следващия елемент за
слагане в масива /цикъл и проверка./.
*/

#include <stdio.h>
#include <stdlib.h>
#include <strings.h>

int main(){
    
    int k, i, j, tmp;
    int A[10]={1,4,8,13,20,22,34,78,90,95};
    int B[10]={2,3,14,17,19,25,30,86,88,99};
    int C[20]; 
    for(k=0;k<10;k++) /* copy A from the beggining of C */
        C[k]= A[k];
    for(k;k<20;k++) /* copy B in C from the edna of A */
        C[k]=B[k-10];
    for(i=0; i<20; i++) /* bubble sorting */
    {
        for(j=i+1; j<20; j++)
        {
            if(C[j] <C[i])
            {
                tmp = C[i];
                C[i] = C[j];
                C[j] = tmp;
            }
        }
    }
    for(i=0;i<20;i++)
        printf("%d, ",C[i]);
    return 0;
}